# written for flow package Vivado 
set sdc_version 1.7 

create_clock -name clk -period 52.63 -waveform { 0.0 26.315 } [get_ports {clk}]
set_clock_uncertainty 0.0 [get_clocks {clk}]

create_clock -name virtual_io_clk -period 52.63
## IO TIMING CONSTRAINTS
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {rst}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {x_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {x_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {m_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {m_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {twiddle_h_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {twiddle_h_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {revArr_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {revArr_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_rsc_triosy_lz}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 0.95 [get_ports {tw_h_rsc_AWID}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {tw_h_rsc_triosy_lz}]

